def add(x, y):
    """
    Сложение двух целых чисел.

    Параметры:
    - x (int): Первое целое число.
    - y (int): Второе целое число.

    Возвращает:
    int: Результат сложения.
    """
    return x + y

def subtract(x, y):
    """
    Вычитание второго целого числа из первого.

    Параметры:
    - x (int): Первое целое число.
    - y (int): Второе целое число.

    Возвращает:
    int: Результат вычитания.
    """
    return x - y

def multiply(x, y):
    """
    Умножение двух целых чисел.

    Параметры:
    - x (int): Первое целое число.
    - y (int): Второе целое число.

    Возвращает:
    int: Результат умножения.
    """
    return x * y

def divide(x, y):
    """
    Деление первого целого числа на второе.

    Параметры:
    - x (int): Первое целое число.
    - y (int): Второе целое число.

    Возвращает:
    float: Результат деления.
    """
    if y == 0:
        return "Ошибка: деление на ноль"
    else:
        return x / y

def power(x, y):
    """
    Возведение первого целого числа в степень второго.

    Параметры:
    - x (int): Основание (целое число).
    - y (int): Показатель степени (целое число).

    Возвращает:
    int: Результат возведения в степень.
    """
    return x ** y
